app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY id
---
  def index
    @users = User.all.order('id')

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
  def show
    @user = User.find(params[:id])
    @user_posts = @user.recent_posts
    @comments = Comment.all